Repository: DIKO-Doc/DIKO-Doc.github.io
Catalog: cht-to-eng/cht-to-eng-omegat.tmx
Source language: zh_tw
Languages: en

source: Whether to autoprobe virtual functions by a compatible driver. If set to NM_TERNARY_TRUE (1), the kernel will try to bind VFs to a compatible driver and if this succeeds a new network interface will be instantiated for each VF. If set to NM_TERNARY_FALSE (0), VFs will not be claimed and no network interfaces will be created for them. When set to NM_TERNARY_DEFAULT (-1), the global default is used; in case the global default is unspecified it is assumed to be NM_TERNARY_TRUE (1).
en: 是否通過兼容的驅動程序自動探測虛擬功能。如果設置為NM_TERNARY_TRUE（1），則內核將嘗試將VF綁定到兼容的驅動程序，如果成功，將為每個VF實例化新的網絡接口。如果設置為NM_TERNARY_FALSE（0），則不會聲明VF，也不會為它們創建網絡接口。設置為NM_TERNARY_DEFAULT（-1）時，使用全局默認值;如果未指定全局默認值，則假定它是NM_TERNARY_TRUE（1）。

source: Whether to enable Path MTU Discovery on this tunnel.
en: 是否在此隧道上啟用Path MTU Discovery。

source: Whether to highlight syntax in comparisons. Because of Meld’s own color highlighting, this is off by default.
en: 是否在比對中標示語法。由於 Meld 自身的色彩標示，因此預設情況下這是關閉的。

source: Whether to indent using spaces or tabs
en: 要使用空格還是 tab 來縮排

source: Whether to manage IPv6 SLAAC
en: 是否管理IPv6 SLAAC

source: While editing the file “%s”:
en: When editing fayl “%s”:

source: While setting up signal handler: %m
en: 當設定信號處理者時：%m

source: While setting up signal stack: %m
en: 當設定信號堆疊時：%m

source: Who_le word
en: 完整單字(_L)

source: Whole words only
en: Whole wörds onli

source: Wi-Fi
en: 無線網路

source: Wi-Fi connection %d
en: Wi-Fi 連線 %d

source: Wi-Fi network mode; one of "infrastructure", "adhoc" or "ap". If blank, infrastructure is assumed.
en: Wi-Fi網絡模式; “基礎設施”，“adhoc”或“ap”之一。如果為空，則假設基礎設施。

source: Wi-Fi radio switch
en: Wi-fi radio 開關

source: Wi-Fi scan list
en: Wi-Fi 掃描清單

source: Wi-Fi security settings
en: Wi-Fi安全設置

source: Width of an indentation step
en: 縮排的每級寬度

source: Wired
en: 有線網路

source: Wired 802.1X authentication
en: 有線網路 802.1X 身份認證

source: Wired connection %d
en: 有線連線 %d

source: Wireless channel to use for the Wi-Fi connection. The device will only join (or create for Ad-Hoc networks) a Wi-Fi network on the specified channel. Because channel numbers overlap between bands, this property also requires the "band" property to be set.
en: 用於Wi-Fi連接的無線信道。設備將僅在指定信道上加入（或為Ad-Hoc網絡創建）Wi-Fi網絡。由於通道編號在波段之間重疊，因此該屬性還需要設置“波段”屬性。

source: With "cloned-mac-address" setting "random" or "stable", by default all bits of the MAC address are scrambled and a locally-administered, unicast MAC address is created. This property allows to specify that certain bits are fixed. Note that the least significant bit of the first MAC address will always be unset to create a unicast MAC address. If the property is NULL, it is eligible to be overwritten by a default connection setting. If the value is still NULL or an empty string, the default is to create a locally-administered, unicast MAC address. If the value contains one MAC address, this address is used as mask. The set bits of the mask are to be filled with the current MAC address of the device, while the unset bits are subject to randomization. Setting "FE:FF:FF:00:00:00" means to preserve the OUI of the current MAC address and only randomize the lower 3 bytes using the "random" or "stable" algorithm. If the value contains one additional MAC address after the mask, this address is used instead of the current MAC address to fill the bits that shall not be randomized. For example, a value of "FE:FF:FF:00:00:00 68:F7:28:00:00:00" will set the OUI of the MAC address to 68:F7:28, while the lower bits are randomized. A value of "02:00:00:00:00:00 00:00:00:00:00:00" will create a fully scrambled globally-administered, burned-in MAC address. If the value contains more than one additional MAC addresses, one of them is chosen randomly. For example, "02:00:00:00:00:00 00:00:00:00:00:00 02:00:00:00:00:00" will create a fully scrambled MAC address, randomly locally or globally administered.
en: 通過“cloned-mac-address”設置“random”或“stable”，默認情況下，MAC地址的所有位都被加擾，並創建本地管理的單播MAC地址。此屬性允許指定某些位是固定的。請注意，將始終取消設置第一個MAC地址的最低有效位以創建單播MAC地址。如果屬性為NULL，則可以通過默認連接設置覆蓋該屬性。如果值仍為NULL或空字符串，則默認為創建本地管理的單播MAC地址。如果該值包含一個MAC地址，則該地址用作掩碼。掩碼的設置位用設備的當前MAC地址填充，而未設置的位用於隨機化。設置“FE：FF：FF：00：00：00”表示保留當前MAC地址的OUI，並僅使用“隨機”或“穩定”算法隨機化低3字節。如果該值在掩碼之後包含一個附加MAC地址，則使用該地址而不是當前MAC地址來填充不應隨機化的位。例如，值“FE：FF：FF：00：00：00 68：F7：28：00：00：00”將MAC地址的OUI設置為68：F7：28，而低位為隨機。值“02：00：00：00：00：00 00：00：00：00：00：00”將創建一個完全加擾的全局管理的燒錄MAC地址。如果該值包含多個附加MAC地址，則隨機選擇其中一個。例如，“02：00：00：00：00：00 00：00：00：00：00：00 02：00：00：00：00：00”將創建一個完全加擾的MAC地址，隨機本地或全局管理。

source: WordPress Errors Log
en: WordPress Öras Logs

source: WordPress error
en: WordPress öra

source: Words
en: Wörds

source: Work around VR4130 mflo/mfhi errata
en: 為 VR4130 mflo/mfhi 缺陷提供變通

source: Work around an early 4300 hardware bug
en: 為早期 4300 的硬體缺陷提供變通

source: Work around bug in multiplication instruction
en: 為乘法指令中的缺陷提供變通

source: Work around certain R4000 errata
en: 為某些 R4000 缺陷提供變通

source: Work around certain VR4120 errata
en: 為某些 VR4210 缺陷提供變通

source: Work around errata for early SB-1 revision 2 cores
en: 為早期 SB-1 rev 2 核心的缺陷提供變通

source: Work around hardware multiply bug
en: 為硬體乘法缺陷提供變通

source: Wrap around
en: Wräp àraund

source: Wrap at:
en: Wräp à:

source: Wrap mode
en: 換列模式

source: Wrapped
en: 自動換列

source: Writing module %s at line %d column %d: %s
en: 讀入模組 %s，於列 %d 行 %d：%s

source: Writing to %s failed: %s
en: 寫入 %s 失敗：%s

source: XLIFF Translation Files
en: XLIFF Transleiçion Fayls

source: XXX entering pop_everything ()
en: XXX 進入 pop_everything ()

source: You are running a case insensitive comparison on a case sensitive filesystem. The following files in this folder are hidden:
en: 您在區分大小寫的檔案系統上執行不區分大小寫的比對。此資料夾中的以下檔案是隱藏的：

source: You can specify this option more than once. Press <Enter> when you're done.
en: 您可以多次指定此選項。按 <Enter> 當你完成了。

source: You may edit the following properties: %s
en: 您可編輯下列內容：%s

source: You may edit the following settings: %s
en: 您可編輯以下設定：%s

source: You may try running 'verify fix' to fix errors.
en: 您可以嘗試運行“驗證修復”來修復錯誤。

source: You must restart Poedit for this change to take effect.
en: Du skal genstarte Poedit før denne ændring træder i kraft.

source: Your Name
en: Neidè Neim

source: Your changes will be lost if you don’t save them.
en: Neidè čeinjs wa losen if not seiven.

source: Your copy is upgraded to Poedit Pro.
en: Neidè instoleiçion wa upgreiden tu Poedit Pro.

source: Your name and email address are only used to set the Last-Translator header of GNU gettext files.
en: Neidè neim en e-meil ädjres wa onli yusen tu set «Last-Translator» nigè GNU gettext fayls dè hēdā-fīld.

source: Zero
en: Mwu

source: Zero is not a valid statement label at %C
en: 零不是 %C 處的一個有效的敘述標籤

source: Zoom
en: ẑum

source: [%s] Computing differences
en: [%s] 正在計算差異

source: [%s] Done
en: [%s] 完成

source: [%s] Merging files
en: [%s] 正在合併檔案

source: [%s] Scanning %s
en: [%s] 正在掃描 %s

source: ['%s' setting values]
en: [「%s」設定值]

source: [Leaving %s]
en: [離開 %s]

source: [None]
en: [沒有]

source: [cannot find %s]
en: [找不到 %s]

source: [super ...] must appear in a method context
en: [super ...] 必須出現在方法上下文中

source: _3-way comparison
en: _3 向比對

source: _About
en: 關於(_A)

source: _Add
en: 加入(_A)

source: _Blank comparison
en: 空白比對(_B)

source: _Cancel
en: 取消(_C)

source: _Changes
en: 變更(_C)

source: _Compare
en: 比對(_C)

source: _Contents
en: 內容(_C)

source: _Delete Permanently
en: 永久刪除(_D)

source: _Discard
en: 捨棄(_D)

source: _Edit
en: 編輯(_E)

source: _Editor font:
en: 編輯器字型(_E)：

source: _File
en: 檔案(_F)

source: _Flatten
en: 合併顯示(_F)

source: _Help
en: 求助(_H)

source: _Insert spaces instead of tabs
en: 用空格替換 Tab(_I)

source: _Keep highlighting
en: 保持語法標示(_K)

source: _Match case
en: 符合大小寫(_M)

source: _Modified
en: 已修改(_M)

source: _New Comparison…
en: 新的比對(_N)…

source: _Next
en: 下一個(_N)

source: _Normal
en: 正常(_N)

source: _Order when comparing file revisions:
en: 比對檔案修訂版時的順序(_O)：

source: _Preferences
en: 偏好設定(_P)

source: _Previous
en: 上一個(_P)

source: _Push
en: 推送(_P)

source: _Push commits
en: 推送提交(_P)

source: _Quit
en: 退出(_Q)

source: _Reload
en: 重新載入(_R)

source: _Remove
en: 移除(_R)

source: _Replace
en: 取代(_R)

source: _Replace…
en: 取代(_R)…

source: _Reverse patch direction
en: 反轉修正方向(_R)

source: _Save
en: 儲存(_S)

source: _Save as UTF-8
en: 以 UTF-8 編碼儲存(_S)

source: _Tab width:
en: Tab 寬度(_T)：

source: _Timestamp resolution:
en: 時間戳精細度(_T)：

source: _Toolbar
en: 工具列(_T)

source: _Update
en: 更新(_U)

source: _Use the system fixed width font
en: 使用系統固定寬度字型(_U)

source: _View
en: 檢視(_V)

source: __builtin_eh_return not supported on this target
en: __builtin_eh_return 在此目標平臺上不受支援

source: a connection using '%s' authentication cannot specify WPA ciphers
en: 使用'連接'%s' 身份驗證無法指定WPA密碼

source: a connection using '%s' authentication cannot specify WPA protocols
en: 使用'連接'%s' 身份驗證無法指定WPA協議

source: a connection using '%s' authentication cannot specify a WPA password
en: 使用'連接'%s' 身份驗證無法指定WPA密碼

source: a connection using '%s' authentication cannot use WPA key management
en: 使用'連接'%s' 身份驗證無法使用WPA密鑰管理

source: a fixed TTL is allowed only when path MTU discovery is enabled
en: 只有在啟用路徑MTU發現時才允許使用固定的TTL

source: a parameter list with an ellipsis can%'t match an empty parameter name list declaration
en: 帶有省略號的參數清單無法與空參數名清單宣告匹配

source: a storage class can only be specified for objects and functions
en: 只能為物件和函式指定存儲類別

source: a template-id may not appear in a using-declaration
en: 範本識別碼不允許出現在 using 宣告中

source: a using-declaration cannot specify a template-id. Try %<using %D%>
en: using 宣告不能指定一個範本識別碼。請嘗試 %<using %D%>

source: abort in %s, at %s:%d
en: 在 %s 中放棄，於 %s:%d

source: abstract declarator %qT used as declaration
en: 抽象宣告 %qT 做為宣告

source: access denied
en: 拒絕存取

source: accumulator is not a constant integer
en: 累加數不是一個整常數

source: accumulator number is out of bounds
en: 累加器個數越界

source: activate [<ifname>] [/<ap>|<nsp>] :: activate the connection Activates the connection. Available options: <ifname> - device the connection will be activated on /<ap>|<nsp> - AP (Wi-Fi) or NSP (WiMAX) (prepend with / when <ifname> is not specified)
en: activate [<ifname>] [/<ap>|<nsp>] :: 啟用連線 啟用連線。 可用選項： <ifname> - 連線將會被啟用於的裝置 /<ap>|<nsp> - AP（Wi-Fi）或是 NSP（WiMAX）（當未指定 <ifname> 時，以 / 作為前置）

source: activated
en: 已啟用

source: activating
en: 啟用中

source: address of explicit register variable %qD requested
en: 要求明確暫存器變數 %qD 的位址。

source: address of global register variable %qD requested
en: 要求全域暫存器變數 %qD 的位址

source: address of local variable %q+D returned
en: 回傳了局部變數的 %q+D 的位址

source: address of register variable %qD requested
en: 要求暫存器變數 %qD 的位址。

source: address offset not a constant
en: 位址偏移量不是一個常數

source: after previous specification in %q+#D
en: 但先前在 %q+#D 中已有指定

source: aggregate %q#D has incomplete type and cannot be defined
en: 聚合 %q#D 類型不完全，無法被定義

source: aggregate value used where a float was expected
en: 需要浮點數時使用了聚合值

source: aggregate value used where an integer was expected
en: 需要整數時使用了聚合值

source: alignment may not be specified for %q+D
en: 不能為 %q+D 指定對齊

source: alignment must be a small power of two, not %d
en: 對齊邊界必須是 2 的較小次方，而不是 %d

source: alignment of %q+D is greater than maximum object file alignment. Using %d
en: %q+D 的對齊要求大於目的檔案的最大對齊邊界。使用 %d

source: alignment of array elements is greater than element size
en: 陣列元素的對齊邊界比元素大小還要大

source: all member functions in class %qT are private
en: 類別 %qT 中所有成員函式都是私有的

source: ambiguates built-in declaration %q#D
en: 使內建宣告 %q#D 出現歧義

source: ambiguates old declaration %q+#D
en: 使舊的宣告 %q+#D 出現歧義

source: ambiguous class template instantiation for %q#T
en: %q#T 的類別範本實體化有歧義

source: ambiguous conversion for array subscript
en: 為陣列下標的轉換有歧義

source: ambiguous template specialization %qD for %q+D
en: 有歧義的範本特例化 %qD (為 %q+D)

source: an argument type that has a default promotion can%'t match an empty parameter name list declaration
en: 具有預設提升的引數類型不能匹配空參數名清單宣告

source: an asm-specification is not allowed on a function-definition
en: 函式定義中不允許出現 asm 指定

source: anachronism:
en: 時代錯誤：

source: anachronistic old-style base class initializer
en: 年代錯誤的舊式基礎類別初始值設定

source: anonymous %s declared inside parameter list
en: 在參數清單中宣告了匿名 %s

source: anonymous struct not inside named type
en: 匿名結構不在具名類型內

source: anonymous union with no members
en: 匿名聯合沒有成員

source: applying #pragma weak %q+D after first use results in unspecified behavior
en: 在第一次使用後套用 #pragma weak %q+D 導致不可預知的後果

source: args to be formatted is not %<...%>
en: 待格式化的引數不是 %<...%>

source: argument %d of %qE might be a candidate for a format attribute
en: 引數 %d(屬於 %qE)可能是 format 屬性的備選

source: argument %q+D might be clobbered by %<longjmp%> or %<vfork%>
en: 引數 %q+D 可能為 %<longjmp%> 或 %<vfork%> 所篡改

source: argument %qD doesn%'t match built-in prototype
en: 引數 %qD 與內建原型不符

source: argument %qD doesn%'t match prototype
en: 引數 %qD 與原型不符

source: argument %qd is not a constant
en: 引數 %qd 不是一個常數

source: argument %qs to %<-Wnormalized%> not recognized
en: 引數 %qs(給予 %<-Wnormalized%>)無法識別

source: argument 1 must be a 5-bit signed literal
en: 引數 1 必須是一個 5 位有號字面值

source: argument 1 of __builtin_altivec_predicate is out of range
en: __builtin_altivec_predicate 的第 1 個引數越界

source: argument 1 of __builtin_altivec_predicate must be a constant
en: __builtin_altivec_predicate 的第一個引數必須是常數

source: argument 1 of __builtin_spe_predicate must be a constant
en: __builtin_spe_predicate 的第一個引數必須是常數

source: argument 2 must be a 5-bit unsigned literal
en: 引數 2 必須是一個 5 位無號字面值

source: argument of %<__builtin_eh_return_regno%> must be constant
en: %<__builtin_eh_return_regno%> 的引數必須是常數

source: argument of function call might be a candidate for a format attribute
en: 函式的引數可能是 format 屬性的備選

source: argument to %qs must be a 2-bit unsigned literal
en: %qs 的引數必須是一個 2 位無號原文

source: arguments to destructor are not allowed
en: 解構函式不能有參數

source: arithmetic IF
en: 算術 IF

source: arithmetic on pointer to an incomplete type
en: 在參照不完全類型的指標上執行算術運算

source: array %q+D assumed to have one element
en: 假定陣列 %q+D 有一個元素

source: array %qD initialized by parenthesized string literal %qE
en: 陣列 %qD 被有括號的字面字串 %qE 所初始化

source: array bound forbidden after parenthesized type-id
en: 括起的類型識別碼後面不能出現陣列邊界

source: array index in initializer exceeds array bounds
en: 初始化時陣列索引越界

source: array index in non-array initializer
en: 在非陣列初始值設定項中出現陣列索引

source: array index range in initializer exceeds array bounds
en: 初始值設定中資料索引範圍超出陣列邊界

source: array initialized from non-constant array expression
en: 用非常數的陣列運算式初始化陣列

source: array initialized from parenthesized string constant
en: 用括號中的字串常數初始化陣列

source: array of inappropriate type initialized from string constant
en: 用字串常數初始化的陣列類型不合適

source: array size missing in %q+D
en: 在 %q+D 中缺少陣列大小

source: array size missing in %qD
en: %qD 缺少陣列大小

source: array subscript is not an integer
en: 陣列下標不是一個整數

source: arrays of functions are not meaningful
en: 函式陣列是沒有意義的

source: as it is a non-system directory that duplicates a system directory
en: 因為它是一個重複了系統目錄的非系統目錄

source: asleep
en: 睡眠中

source: asm clobber conflict with input operand
en: 組譯篡改清單與輸入運算元衝突

source: asm clobber conflict with output operand
en: 組譯篡改清單與輸出運算元衝突

source: asm declaration ignored due to conflict with previous rename
en: asm 宣告因與先前的 rename 衝突而被忽略

source: asm operand %d probably doesn%'t match constraints
en: 組譯運算元 %d 與約束可能不匹配

source: assert: %s is assign compatible with %s
en: assert：%s 與 %s 賦值相容

source: assertion missing after %qs
en: %qs 後判定語

source: assignment
en: 賦值

source: assignment (not initialization) in declaration
en: 賦值(不是初始化)出現在宣告中

source: assignment from distinct Objective-C type
en: 從獨一無二的 Objective-C 類型賦值

source: assignment from incompatible pointer type
en: 永遠不相容的指標類型賦值

source: assignment left-hand side might be a candidate for a format attribute
en: 賦值的左手邊可能是 format 屬性的備選時

source: assignment makes integer from pointer without a cast
en: 賦值時將指標賦給整數，未作類型轉換

source: assignment makes pointer from integer without a cast
en: 賦值時將整數賦給指標，未作類型轉換

source: assignment of read-only member %qD
en: 向唯讀成員 %qD 賦值

source: assignment of read-only variable %qD
en: 向唯讀變數 %qD 賦值

source: assignment suppression
en: 取消賦值

source: assuming cast to type %qT from overloaded function
en: 假定從多載函式轉換到類型 %qT

source: assuming pointer to member %qD
en: 假定是成員指標 %qD

source: assuming that the loop counter does not overflow
en: 假定循環計數不會溢出

source: assuming that the loop is not infinite
en: 假定循環有窮

source: attempt to take address of bit-field structure member %qD
en: 試圖取位元段結構成員 %qD 的位址

source: attribute declaration
en: 屬性宣告

source: attribute is not valid for a IPv4 route
en: attribute對IPv4路由無效

source: attribute is not valid for a IPv6 route
en: 屬性對IPv6路由無效

source: attributes after parenthesized initializer ignored
en: 括起的初始值設定後出現的屬性被忽略

source: attributes are not allowed on a function-definition
en: 函式定義中不允許有屬性

source: attributes in parameter array declarator ignored
en: 出現在參數陣列宣告中的屬性被忽略

source: autoconnect
en: 自動連接

source: back :: go to upper menu level
en: back :: 往上返回上一層的選單

source: bad PC range for debug info for local %q+D
en: 局部變數 %q+D 的呼叫資訊中 PC 範圍錯誤

source: bad address
en: 錯誤位址

source: bad address, not (reg+disp):
en: 位址錯誤，不是(reg+disp)：

source: bad address, not post_inc or pre_dec:
en: 錯誤的位址，不是 post_inc 或 pre_dec:

source: bad condition code
en: 錯誤的條件碼

source: bad format of .zip/.jar archive
en: .zip/.jar 檔案格式錯誤

source: bad insn for 'A'
en: 「A」的指令錯誤

source: bad insn in frv_print_operand, 0 case
en: frv_print_operand 中不正確誤指令，0 case

source: bad insn in frv_print_operand, bad const_double
en: frv_print_operand 中不正確誤指令，錯誤的 const_double

source: bad insn in frv_print_operand, z case
en: frv_print_operand 中不正確誤指令，z case

source: bad insn to frv_print_operand, 'F' modifier:
en: 給 frv_print_operand 錯誤的指令，「F」修飾符：

source: bad insn to frv_print_operand, 'L' modifier:
en: 給 frv_print_operand 錯誤的指令，「L」修飾符：

source: bad insn to frv_print_operand, 'M/N' modifier:
en: 給 frv_print_operand 錯誤的指令，「M/N」修飾符：

source: bad insn to frv_print_operand, 'O' modifier:
en: 給 frv_print_operand 錯誤的指令，「O」修飾符：

source: bad insn to frv_print_operand, 'e' modifier:
en: 給 frv_print_operand 錯誤的指令，「e」修飾符：

source: bad insn to frv_print_operand, 'f' modifier:
en: 給 frv_print_operand 錯誤的指令，「f」修飾符：

source: bad insn to frv_print_operand, 'g' modifier:
en: 給 frv_print_operand 錯誤的指令，「g」修飾符：

source: bad insn to frv_print_operand, P modifier:
en: 給 frv_print_operand 錯誤的指令，P 修飾符：

source: bad insn to frv_print_operand_address:
en: 給 frv_print_operand_address 錯誤的指令：

source: bad insn to frv_print_operand_memory_reference:
en: 給 frv_print_operand_memory_reference 錯誤的指令：

source: bad method signature
en: 錯誤的方法簽名

source: bad output_condmove_single operand
en: 錯誤的 output_condmove_single 運算元

source: bad output_move_double operand
en: 錯誤的 output_move_double 運算元

source: bad output_move_single operand
en: 錯誤的 output_move_single 運算元

source: bad register
en: 錯誤的暫存器名

source: bad register to frv_print_operand_memory_reference_reg:
en: 給 frv_print_operand_memory_reference_reg 錯誤的暫存器：

source: bad shift insn:
en: 錯誤的 shift 指令

source: bad string constant
en: 錯誤的字串常數

source: bad test
en: 錯誤的測試

source: bad type in parameter debug info
en: 參數除錯資訊中類型錯誤

source: bad value %<%s%> for -mtls-size= switch
en: -mtls-size= 開關的值 %<%s%> 無效

source: bad value %qs for -mfp-rounding-mode switch
en: -mfp-rounding-mode 開關的值 %qs 不正確

source: bad value %qs for -mfp-trap-mode switch
en: -mfp-trap-mode 開關的值 %qs 不正確

source: bad value %qs for -mmemory-latency
en: -mmemory-latency 開關的值 %qs 錯誤

source: bad value %qs for -mtls-size switch
en: -mtls-size 開關的值 %qs 不正確

source: bad value %qs for -mtrap-precision switch
en: -mtrap-precision 開關的值 %qs 不正確

source: bad value (%s) for -march= switch
en: -march= 所帶參數(%s)不正確

source: bad value (%s) for -mcmodel= switch
en: -mcmodel= 值(%s)不正確

source: bad value constant type %d, index %d
en: 常數值錯誤，類型 %d，索引 %d

source: bad value for -mcall-%s
en: -mcall-%s 值不正確

source: bad value for -msdata=%s
en: -msdata=%s 值不正確

source: bad zip/jar file %s
en: 損壞的 zip/jar 檔案 %s

source: bandwidth percentages must total 100%%
en: 頻寬比率總額必須是 100%%

source: base %qT will be initialized after
en: 基礎類別 %qT 將在

source: base class %q#T has a non-virtual destructor
en: 基礎類別 %q#T 有一個非虛解構函式

source: base operand of %<->%> has non-pointer type %qT
en: %<->%> 的基運算元具有非指標類型 %qT

source: base operand of %<->%> is not a pointer
en: %<->%> 的左運算元不是一個指標

source: base type %qT fails to be a struct or class type
en: 基礎類別型 %qT 不是結構或類別

source: bb %d do not belong to loop %d
en: 基本區塊 %d 不屬於循環 %d

source: bb %d on wrong place
en: 基本區塊 %d 位置不正確

source: because of local method %q+#D with same name
en: 因為局部方法 %q+#D 與之同名

source: binary data missing
en: 二進制數據丟失

source: bit-field %q+#D with non-integral type
en: 位元段 %q+#D 有非整數的類型

source: bit-field %q+D width not an integer constant
en: 位元段 %q+D 的寬度不是一個整數常數

source: bit-field %qs has invalid type
en: 位元段 %qs 類型無效

source: block IF
en: 區塊 IF

source: bogus DISPOSE construction: %d
en: 誤判的 DISPOSE 建構：%d

source: bogus JR construction: %d
en: 誤判的 JR 建構：%d

source: bogus PREPEARE construction: %d
en: 誤判的 PREPEARE 建構：%d

source: boolean registers required for the floating-point option
en: 浮點選項需要布林暫存器

source: both speed and duplex are required for static link configuration
en: 靜態鏈路配置需要速度和雙工

source: both speed and duplex should have a valid value or both should be unset
en: 速度和雙工都應具有有效值，或者兩者都應取消設置

source: braced-group within expression allowed only inside a function
en: 運算式中的大括號組只允許出現在函式中

source: braces around scalar initializer
en: 標量初始化帶大括號

source: braces around scalar initializer for type %qT
en: 類型 %qT 的標量初始化帶大括號

source: branch %2d never executed
en: branch %2d 從未被執行

source: branch %2d taken %s%s
en: branch %2d 被執行 %s%s

source: break statement not within loop or switch
en: break 敘述不在循環或開關敘述內

source: built-in function %q+D declared as non-function
en: 內建函式 %q+D 未被宣告為函式

source: but does not override %<%T(const %T&)%>
en: 但沒有多載 %<%T(const %T&)%>

source: but does not override %<operator=(const %T&)%>
en: 也沒有多載 %<operator=(const %T&)%>

source: by %q+D
en: 為 %q+D

source: bytes
en: 位元組

source: call %2d never executed
en: call %2d 從未被執行

source: call %2d returned %s
en: call %2d 回傳了 %s

source: call of overloaded %<%D(%A)%> is ambiguous
en: 呼叫多載的 %<%D(%A)%> 有歧義

source: call of overloaded %<%s(%A)%> is ambiguous
en: 對多載的 %<%s(%A)%> 的呼叫有歧義

source: call to Java %<catch%> or %<throw%> with %<jthrowable%> undefined
en: 呼叫 Java %<catch%> 或 %<throw%> 時 %<jthrowable%> 未定義

source: call to function %qD which throws incomplete type %q#T
en: 呼叫的函式 %qD 會拋出不完全的類型 %q#T

source: call to function which throws incomplete type %q#T
en: 呼叫的函式會拋出不完全的類型 %q#T

source: call to non-function %qD
en: 呼叫非函式的 %qD

source: call-clobbered register used for global register variable
en: 呼叫篡改暫存器做為全域暫存器變數

source: called from here
en: 從此處呼叫

source: called object %qE is not a function
en: 被呼叫的物件 %qE 不是一個函式

source: can not use an object as parameter to a method
en: 不能將物件做為方法的參數

source: can only use %qE attribute on file-scope definitions of objects of class type
en: 只能將 %qE 屬性用於某個類別的物件的檔案作用欄位定義

source: can%'t create precompiled header %s: %m
en: 無法建立預先編譯頭 %s：%m

source: can%'t open %s: %m
en: 無法開啟%s：%m

source: can%'t read %s: %m
en: 無法讀取 %s：%m

source: can%'t seek in %s: %m
en: 無法在 %s 中定位：%m

source: can%'t write %s: %m
en: 無法寫入 %s：%m

source: can%'t write to %s: %m
en: 無法寫入 %s：%m

source: can't be simultaneously disabled and enabled
en: 無法同時禁用和啟用

source: can't open %s: %m
en: 無法開啟 %s：%m

source: can't set property of type '%s' from value of type '%s'
en: 無法設置類型的屬性%s' 從類型的價值'%s'

source: candidate 1:
en: 備選 1：

source: candidate 2:
en: 備選 2：

source: candidates are: %+#D
en: 備選為：%+#D

source: cannot bind bitfield %qE to %qT
en: 無法將位元段 %qE 繫結到 %qT

source: cannot bind packed field %qE to %qT
en: 不能將緊實的欄位 %qE 繫結到 %qT

source: cannot call member function %qD without object
en: 沒有物件無法呼叫成員函式 %qD
